### Importing and exporting data
with Read table for general delimated file

In [2]:
import pandas as pd
# Read table mostly used for tab seperated .txt files
df = pd.read_table('datasets/data.txt') # relative path
df

  name  score sex
0  Tim     80   M
1  Tom     85   M
2  Kim     70   F
3  Sam     90   M
4  Efe     75   M

In [4]:
# Read csv is commonly used for most data readings, its comma separated
df2 = pd.read_csv('datasets/data2.txt')
df2

    Tom  80  M
0   Tim  85  M
1   Kim  70  M
2  Kate  90  F
3  Alex  75  F

In [6]:
df = pd.read_csv('datasets/data2.txt', sep=',', header=None)
df

      0   1  2
0   Tom  80  M
1   Tim  85  M
2   Kim  70  M
3  Kate  90  F
4  Alex  75  F